app/views/favourites/edit.html.erb

SELECT "venues".* FROM "venues" INNER JOIN "favourites_venues" ON "venues"."id" = "favourites_venues"."venue_id" WHERE "favourites_venues"."favourite_id" = $1  [["favourite_id", 1]]
---

<% @favourite.venues.each do |venue| %>

SELECT "venues"."name", "venues"."id" FROM "venues"
---
  <%= f.label :venue_id %>
  <%= f.select :venue_ids, Venue.pluck(:name, :id) %>