app/views/favourites/index.html.erb

  <h2><%= f.name %></h2>
  <% f.venues.each do |v| %>
---
SELECT "venues".* FROM "venues" INNER JOIN "favourites_venues" ON "venues"."id" = "favourites_venues"."venue_id" WHERE "favourites_venues"."favourite_id" = $1  [["favourite_id", 1]]