app/views/favourites/show.html.erb


<% @favourite.venues.each do |v| %>
---
SELECT "venues".* FROM "venues" INNER JOIN "favourites_venues" ON "venues"."id" = "favourites_venues"."venue_id" WHERE "favourites_venues"."favourite_id" = $1  [["favourite_id", 1]]