app/controllers/favourites_controller.rb

  def edit
    @favourite = Favourite.find params[:id]
---
SELECT  "favourites".* FROM "favourites" WHERE "favourites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    favourite = Favourite.find params[:id]
    venue = Venue.find params[:favourite][:venue_ids]
    favourite.venues << venue
---
SELECT  "favourites".* FROM "favourites" WHERE "favourites"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT  "venues".* FROM "venues" WHERE "venues"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
INSERT INTO "favourites" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Craigsy's list"], ["user_id", 13], ["created_at", "2021-10-24 23:49:25.041883"], ["updated_at", "2021-10-24 23:49:25.041883"]]

  def create
    favourite = @current_user.favourites.new user_params
    favourite.save
---
INSERT INTO "favourites" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "New Night Out"], ["user_id", 9], ["created_at", "2021-10-25 02:04:20.305331"], ["updated_at", "2021-10-25 02:04:20.305331"]]

  def show
    @favourite = Favourite.find params[:id]
---
SELECT  "favourites".* FROM "favourites" WHERE "favourites"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    favourite = Favourite.find params[:id]
    favourite.destroy
---
SELECT  "favourites".* FROM "favourites" WHERE "favourites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "favourites" WHERE "favourites"."id" = $1  [["id", 8]]